In [1]:
import pandas as pd

# Read and Write CSV and XLS files

In [5]:
df=pd.read_csv('weather_data.csv')
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

## Reading xls files

In [6]:
df=pd.read_excel('weather_data.xlsx')
df.head()

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

## Write DF to CSV

In [12]:
(df.to_csv('new.csv'))
"""
Our new.csv  will look like:
	day	temperature	windspeed	event
0	1/1/2017	32	6	Rain
1	1/2/2017	35	7	Sunny
2	1/3/2017	28	2	Snow
3	1/4/2017	24	7	Snow
4	1/5/2017	32	4	Rain
5	1/6/2017	31	2	Sunny

"""

'\nOur new.csv  will look like:\n\tday\ttemperature\twindspeed\tevent\n0\t1/1/2017\t32\t6\tRain\n1\t1/2/2017\t35\t7\tSunny\n2\t1/3/2017\t28\t2\tSnow\n3\t1/4/2017\t24\t7\tSnow\n4\t1/5/2017\t32\t4\tRain\n5\t1/6/2017\t31\t2\tSunny\n\n'

In [13]:
"""
So as we can se there is and column of index only and we dont want to write the index
"""
# so we can use
df.to_csv("new_no_index.csv",index=False)

In [14]:
! pip install openpyxl

Collecting openpyxl
  Downloading https://files.pythonhosted.org/packages/cf/63/811f01cd0e473e2d2ee2b257bf2ae95efaf960c4bee74195e331e8e139e2/openpyxl-2.5.14.tar.gz (173kB)
    100% |████████████████████████████████| 174kB 204kB/s ta 0:00:01
Collecting jdcal (from openpyxl)
  Downloading https://files.pythonhosted.org/packages/a0/38/dcf83532480f25284f3ef13f8ed63e03c58a65c9d3ba2a6a894ed9497207/jdcal-1.4-py2.py3-none-any.whl
Collecting et_xmlfile (from openpyxl)
  Downloading https://files.pythonhosted.org/packages/22/28/a99c42aea746e18382ad9fb36f64c1c1f04216f41797f2f0fa567da11388/et_xmlfile-1.0.1.tar.gz
Installing collected packages: jdcal, et-xmlfile, openpyxl
  Running setup.py install for et-xmlfile ... done
  Running setup.py install for openpyxl ... done
Successfully installed et-xmlfile-1.0.1 jdcal-1.4 openpyxl-2.5.14

In [15]:
# write df to Excel
df.to_excel("new.xlsx",sheet_name="weather_data")

In [17]:
df.to_excel("without_sheet.xlsx")

In [18]:
df.to_excel("new.xlsx",sheet_name="2nd_sheet")

# Group by

In [73]:
import pandas as pd

In [74]:
df=pd.read_csv('weather_data_cities.csv')
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [78]:
g=df.groupby('city')
print(g.head())

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [72]:
for i,i_df in g:
    print(i)
    print (i_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [33]:
# to get a specific group
g.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [36]:
# Find the maximum temperature in each of the cities 
g.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [37]:
# and if we want to print only temperature

g.max()['temperature']

city
mumbai      92
new york    36
paris       54
Name: temperature, dtype: int64

In [38]:
# to get the basic stats
g.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# Concatenate Data Frames

In [40]:
# creating data frame using dictionary
india_weather=pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
    "temperature":[32,45,30],
    "humidity":[80,60,78]
})
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [41]:
us_weather=pd.DataFrame({
    "city":["new york","chicago ","orland"],
    "temperature":[32,45,30],
    "humidity":[80,60,78]
})
us_weather

       city  temperature  humidity
0  new york           32        80
1  chicago            45        60
2    orland           30        78

In [80]:
# concatenating two dfs
df=pd.concat([india_weather,us_weather])
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
0   new york           32        80
1   chicago            45        60
2     orland           30        78

In [44]:
# and if I want to concat side wise to rows
df=pd.concat([india_weather,us_weather],axis=1)
df

        city  temperature  humidity      city  temperature  humidity
0     mumbai           32        80  new york           32        80
1      delhi           45        60  chicago            45        60
2  bangalore           30        78    orland           30        78

# Merge Data Frames -> like join in mysql

In [49]:
temperature_df=pd.DataFrame({
    "city":["delhi","chicago ","bangalore"],
    "temperature":[32,45,30],
})
temperature_df

        city  temperature
0      delhi           32
1   chicago            45
2  bangalore           30

In [50]:
humidity_df=pd.DataFrame({
    "city":["new york","chicago ","orland"],
    "humidity":[80,60,78]
})
humidity_df

       city  humidity
0  new york        80
1  chicago         60
2    orland        78

In [54]:
# merge two dataframe without explicitly metion index
df=pd.merge(temperature_df,humidity_df,on='city')# inner join , drop if not matching in both 
# tables
df

       city  temperature  humidity
0  chicago            45        60

In [55]:
# Outer Join 
"""
Select from both the tables , if data is missing for colmn in either table put null
"""
df=pd.merge(temperature_df,humidity_df,on='city',how='outer')
df

        city  temperature  humidity
0      delhi         32.0       NaN
1   chicago          45.0      60.0
2  bangalore         30.0       NaN
3   new york          NaN      80.0
4     orland          NaN      78.0

# Numerical Indexing (.loc vs iloc)

In [59]:
df=pd.DataFrame([1,2,3,5,6,7,8,9,19]) # default indexing
df

    0
0   1
1   2
2   3
3   5
4   6
5   7
6   8
7   9
8  19

In [60]:
# custom indexing 
df=pd.DataFrame([1,2,3,5,6,7,8,9,19],index=[49,48,47,46,45,1,2,3,4])
df

     0
49   1
48   2
47   3
46   5
45   6
1    7
2    8
3    9
4   19

In [61]:
df.loc[46]

0    5
Name: 46, dtype: int64

In [64]:
df.iloc[3]

0    5
Name: 46, dtype: int64

In [66]:
df.loc[:2] # it will keep printing until and unless it encounters 2

    0
49  1
48  2
47  3
46  5
45  6
1   7
2   8

In [68]:
df.iloc[:2]

    0
49  1
48  2